//                             Задача 19

// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да








//                             Задача 23

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125


/*
void Qube(int x)
{
    int current = 1;
    while(current <= x)
    {
        int qube = current * current * current;
        Console.Write(qube + " ");
        current++;
    }
}
Console.Write("Inpet number: ");
int n = Convert.ToInt32(Console.ReadLine());
Qube(n);
*/